{"meta":{"title":"William Ke's Blog","subtitle":"the Fantasy World","description":null,"author":"Jheng-You Ke","url":"http://yoursite.com"},"pages":[{"title":"About","date":"2016-09-06T04:43:42.336Z","updated":"2016-09-06T04:43:42.336Z","comments":true,"path":"about/index.html","permalink":"http://yoursite.com/about/index.html","excerpt":"","text":"關於我 關於我 在下柯政佑，凡人一位，剛被慫恿（鼓勵？）離開舒適圈，目前在臺灣大學資訊工程所的通訊與多媒體實驗室攻讀碩士學位。 角色資訊 說明 種族 人族 屬性 宅 陣營 混亂中立 症狀 被害妄想症、強迫症 語言 中文、英文、日文（半吊子）、西班牙文（皮毛） 技能 Java（主要技能）、Unity、Android、Matlab... 專長 塗鴉（棄置多年）、TRPG帶團、時間管理、講屁話 興趣 ACG（Animation.Comic.Game）、小說、電影、體育賽事 關於William Ke's Blog設立本部落格是因為實驗室需要每位成員的個人網頁而成立的。 抱著既然花時間設了部落格，不用白不用的心態，決定持續經營下去。內容本部落格為個人部落格，內容主要是個人主觀的意見與看法。 分享的主題則圍繞在以下幾項： 雜記：個人對於某些非特定事物的看法、日常廢文 課程：聚焦於學校課程，包含課程筆記與修課心得等 ACGN：動畫、漫畫、遊戲、小說的相關心得與推薦文 運動：體育賽事的相關分享，籃球運動為大宗"},{"title":"","date":"2016-09-01T07:57:54.000Z","updated":"2016-09-01T09:37:41.317Z","comments":true,"path":"works/Code_Quest.html","permalink":"http://yoursite.com/works/Code_Quest.html","excerpt":"","text":"Code Quest—勇者啊，用猜數字拯救世界吧！ Code Quest—勇者啊，用猜數字拯救世界吧！Code Quest是一款結合猜數字（又稱終極密碼，Bulls and Cows）與角色培育的益智RPG。遊戲規格 開發團隊：NCU 計算機實習 一上小組 團隊成員：柯政佑、蔣彥亭、謝昆荃、邱義傑、林子寗 開發語言：JAVA 遊戲素材：RPG Maker 2000—Alex、The King of Fighters '96—瑪瓊亞(マチュア；Mature)、Unlight地圖標的、純手繪動畫（by 柯政佑&amp;林子寗） 遊戲介紹 在Code Quest的世界中，玩家將扮演勇者—大中天，透過猜數字的神奇力量，從魔王—黑暗女巫的手中拯救眾生。 遊戲世界涵蓋了古木參天的森林、天寒地凍的冰原、燋金爍石的火山，以及陰森恐怖的女巫古堡。玩家將從名為START的起始點一路向右，展開一連串的冒險。 遊戲提供多條攻略路線，要以擊敗黑暗女巫為首要目標，還是要挑戰所有攻略點，一切交由玩家自己選擇。選擇攻略地點後，便會觸發事件。除了遭遇怪物的戰鬥事件外，也有機會觸發可以獲得稀有道具的寶箱事件。 Code Quest 戰鬥畫面 Code Quest 戰鬥畫面 戰鬥觸發後，會進入戰鬥畫面。玩家可以在畫面左下、右下方查看自己與敵人的生命值（Life）及攻擊力（ATK），並在畫面下方中間的輸入區輸入猜測的數字來發動攻擊。 系統會記錄玩家每次猜測的數字，並提供「幾A幾B」的情報，供玩家做下一步的猜測。 【猜數字遊戲 規則說明】轉自維基百科：猜數字 每猜一組數字，出數者就要根據這個數字給出幾A幾B，其中A前面的數 表示位置正確的數的個數，而B前的數字表示數字正確而位置不對的數的 個數。 如正確答案為5234，而猜的人猜5346，則是1A2B，其中有一個5的位置 對了，記為1A，而3和4這兩個數字對了，而位置沒對，因此記為2B，合起 來就是1A2B。 接著猜的人再根據出題者的幾A幾B繼續猜，直到猜中為止。 至於戰鬥傷害的部分，則是根據每次猜測數字的正確程度而定。猜中一個位置正確的數字（即1A），可以給予怪物一倍攻擊力的傷害，猜中兩個數字，則給予兩倍攻擊力傷害，依此類推。相反地，不論是沒猜中位置的數字（即B），還是連數字本身都沒猜對，怪物都會給予玩家相應的傷害。 另外，若玩家成功猜出所有數字，則可以對怪物產生一擊必殺的效果，直接取得戰鬥的勝利。 戰鬥結束後，玩家有機會獲得怪物掉落的道具。不論是戰鬥勝利從怪物身上取得的道具，或是在寶箱事件中取得的道具，都能在地圖畫面中點選「ITEM」來查看及使用。 遊戲中提供三個儲存格，玩家可以隨時在地圖畫面中點選「SAVE/LOAD」儲存遊戲進度。時下有許多以簡單的益智小遊戲結合RPG概念的作品，像是結合記憶翻牌的マグナメモリア、結合轉珠的龍族拼圖等等。Code Quest嘗試採用具思考性的猜數字與RPG做結合，期望這前所未有的組合能讓玩家有全新的遊戲體驗。遊戲下載點此下載 Code Quest"},{"title":"","date":"2016-09-06T04:38:22.334Z","updated":"2016-09-06T04:38:22.334Z","comments":true,"path":"works/Clash_of_Tower.html","permalink":"http://yoursite.com/works/Clash_of_Tower.html","excerpt":"","text":"Clash of Tower—野豬騎士來囉～ Clash of Tower—野豬騎士來囉～Clash of Tower是一款四人線上即時對戰的守塔遊戲。遊戲規格 開發團隊：NCU 軟體工程 Can小組 團隊成員：柯政佑(Project Manager)、顏修溫、王勤、林冠宇、孫造鴻、聶順成 開發語言：JAVA 遊戲素材：Kingdom Rush、Kenney - Tower Defense assets 遊戲介紹遊戲背景普利希斯，一個人族、獸族、獸人族共處的世界，作為世界中心的「王城」則由東、西、南、北四座堡塔守護著。然而這樣祥和的世界只是表象，統領四大堡塔的諸侯在檯面下總是為了金錢與權力爭得你死我活。這樣的情況隨著國王—金恩年齡的增長，越演越烈。就在國王百年大壽的這天，內戰終於爆發……遊戲架構 Clash of Tower是一款連線對戰遊戲，開始遊戲前需要一台電腦作為伺服器，它將處理遊戲中所有的運算。玩家開啟遊戲客戶端就會自動連線到伺服器，當四名玩家都與伺服器建立連線後，就能開始選擇代表自己的英雄。選完即進入遊戲主畫面。 遊戲操作遊戲的操作非常簡單，玩家只要拖曳欲派遣的士兵到進攻道路上，士兵就會自行沿著道路前進，若在道路上遭遇敵人，士兵會自動展開戰鬥，抵達敵方堡塔，也會自主攻城。 玩家也能透過鍵盤的十字鍵移動視角，查看地圖上其它地區的戰況。英雄＆士兵不論是英雄，還是一般的士兵，都有各自的能力值。 HP：表示該兵種的生命值，當生命值歸零時，就會死亡。 ATK：表示該兵種每次攻擊所能給予敵人的傷害。 DEF：表示傷害承受力，當受到的傷害累積超過此值時，士兵會被擊退一大步。 AGI：表示該兵種行進的速度。 COST：表是招喚該兵種所需的金額。 遊戲中提供四名英雄供玩家挑選。每位英雄的能力值各不相同，但相較於一般的士兵單位，英雄在生命力、攻擊力等數值上都有明顯的優勢。 每位玩家除了自己挑選的英雄外，還能根據戰況調派人族、獸族、獸人族的士兵進行作戰。其中獸族移動速度快、獸人族攻擊力強、人族數值最平均。 一開始玩家只能調派能力值較低的初級士兵（上圖最左方），隨著遊戲的進行，玩家可以花費資金升級各個兵種。堡塔攻擊＆升級 功能列右方的寶劍槽會隨時間流逝而慢慢累積，當能量累積滿後，玩家可以點擊寶劍對堡塔附近的敵人發動強大的攻擊。 點擊畫面右上方的城堡圖示，功能列會轉換成堡塔升級列。玩家能夠花費金錢來修復堡塔的損傷、提升金錢累積速度、增強堡塔主動攻擊的威力。使者＆王城系統 玩家可以花費500金錢調派使者拜訪王城。當使者抵達王城後，畫面左上方會出現「信封」圖示，點擊信封即可使用「王城系統」。 王城系統 抽牌結果 王城系統類似於大富翁遊戲的「機會&amp;命運」，玩家可以選擇要到教堂祈禱，或是拜見國王—金恩。選擇不同，會影響抽牌的結果。 抽牌的效果有利有弊。教堂祈禱容易觸發豐收、天災的效果；拜見國王則容易觸發資源升級/降級的效果。對戰結束 每場戰役時限為10分鐘，時間一到或場上只剩下一座堡塔，對戰就會中止。此時系統會根據玩家的表現進行評分排行，分數最高者獲勝。Clash of Tower將常見的1對1塔防遊戲（如：にゃんこ大戦争）擴增成四人混戰。以守塔遊戲的簡單操作取代複雜的即時戰略系統，讓不擅長複雜操作的玩家也能體會到如世紀帝國般精彩的遊戲體驗。遊戲下載點此下載 Clash of Tower 伺服端 點此下載 Clash of Tower 客戶端 點此下載 Clash of Tower 開發文件&amp;程式規格書補充：教授評語以下為國立中央大學 軟體工程 授課教師—鄭永斌教授的評語"},{"title":"","date":"2016-09-02T10:08:59.546Z","updated":"2016-09-02T10:08:59.546Z","comments":true,"path":"works/Dream_Camera.html","permalink":"http://yoursite.com/works/Dream_Camera.html","excerpt":"","text":"Dream Camera—超級賽亞人、進擊的巨人，想變甚麼就變甚麼 Dream Camera—超級賽亞人、進擊的巨人，想變甚麼就變甚麼Dream Camera是一款利用電腦視覺技術的大頭貼拍照程式。程式規格 開發團隊：NCU 計算機實習 一下小組 團隊成員：柯政佑、許昱琳、何昱璋 開發工具：JAVA、OpenCV、JavaCV 程式素材：ドラゴンボール、進撃の巨人、One Piece、陳國棟教授、League of Legends... 程式介紹介面設計Dream Camera取消了視窗邊框提升介面質感，搭配可愛的手繪按鈕及彈出式的物件選項，呈現夢幻的視覺效果。功能與特色 程式提供各式相框、人物、配件、佈景供使用者挑選。程式對於物件的使用個數並沒有限制，就算使用者想在照片中放入所有的物件也完全沒有問題。 在眾多物件中，有少數幾樣在使用的同時會播放相應的歌曲，以增添拍照的情趣。 本程式以電腦視覺的人臉偵測技術來偵測使用者的臉部位置，再根據其位置添加配件。由「配件來配合人」，而非一般市面上的拍貼機需要由「人來配合配件」，或是拍攝完照片才以手動方式做配件的整合，這樣的設計能減輕拍照的負擔。成果展示 程式下載點此下載 Dream Camera"},{"title":"","date":"2016-09-02T08:54:10.192Z","updated":"2016-09-02T08:54:10.192Z","comments":true,"path":"works/Dungeon_Explorer.html","permalink":"http://yoursite.com/works/Dungeon_Explorer.html","excerpt":"","text":"Dungeon Explorer—在地下城尋求邂逅是否搞錯了什麼！ Dungeon Explorer—在地下城尋求邂逅是否搞錯了什麼！Dungeon Explorer是一款有著爽快戰鬥風格，搭配萌萌魔物娘的纇RPG奇幻小品。遊戲規格 開發人員：柯政佑 開發引擎：Unity 3D 遊戲素材：Capcom - LAST RANKER、Monster Girl Encyclopedia Wiki、Unity Asset Store 遊戲介紹世界觀高聳入雲的世界樹之塔，座落在有冒險者都市之稱的海因斯特城。在這個遍布兇悍魔物的塔內蘊涵了一股強大魔力，傳說這股魔力能夠實現冒險者所有的願望，追求財富、地位、權力、榮耀的眾多冒險者都慕名而來。在這躍躍欲試的人群中，出現了一位尋求美妙邂逅的「勇者」。他，踏出了撼動世界的第一步…… 遊戲世界—海因斯特城內，除了充斥魔物的「世界樹之塔」外，還有指導玩家戰鬥的「世界圖書館」及記錄玩家光榮戰績的「帽客酒館」。 基本介面教學 戰鬥教學 戰鬥教學 在世界圖書館中，女僕—奇奇莫拉會帶領玩家認識海因斯特城內的重要據點及基本操作；魅魔—威爾瑪麗娜則會教導玩家戰鬥的方式與魔物的特性。戰鬥系統遊戲採用按鍵指令的「半即時制」戰鬥系統，透過消耗AP（Action Point；行動點）進行攻擊與防禦。雖然AP會自行恢復但玩家須自行斟酌用量，一但消耗完就會無法出招。 戰鬥畫面 戰鬥畫面 戰鬥的時間並不會停滯，無法像其他回合制遊戲可以慢慢擬定作戰策略。玩家按下指令的瞬間角色就會馬上出招，必須抓緊時機攻擊並預測對方動作進行防禦，才能克敵制勝。玩家的攻擊方式有三種，分別是「斬擊」、「砲擊」及「火球術」。不同的攻擊，對魔物造成的傷害也有所不同，玩家須根據魔物的特性，選擇合適的攻擊。斬擊 輕斬 中斬 重斬 以Z鍵消耗3AP來發動斬擊。連續使用斬擊能夠觸發「連擊蓄力」的效果。三次輕斬接續一次中斬，再兩次輕斬後，以重斬做結，總共六段的連擊能造成敵人強大的傷害。砲擊 砲擊 砲擊 以X鍵消耗1AP來發動砲擊。除了AP以外，砲擊須額外消耗彈藥，畫面右上方會顯示目前彈匣內的彈藥數。彈匣為空時，必須消耗2AP來填充，才能繼續射擊。砲擊的傷害不如斬擊，但對於飛行系的敵人非常有效。火球術 詠唱魔法 招喚火球 投擲火球 以C鍵消耗4AP詠唱火球術。成功招喚出火球後，以V鍵消耗1AP投擲。火球術發動步驟複雜，且需要耗費較多AP，但能給予敵人相當可觀的傷害。防禦以S鍵進行防禦。防禦是一種持續性的狀態，每 0.2秒會消耗1AP，且進行防禦的同時AP不會自動回復。防禦能夠抵擋除了「Medusa石化之眼」以外的所有傷害。魔物娘 梅杜莎、史萊姆、吸血鬼…形形色色的魔物娘不單單是外觀上的不同，在戰鬥風格上也有不少變化，等著玩家們去挑戰。 Medusa石化之眼 Kesaran泡沫封鎖 Vampire吸血 Witch洪水衝擊 榮譽榜 Game Over 遊玩評比 不論是中途戰敗，或是成功通關，系統都會根據玩家的表現給予評比。此外，系統還會根據每次的遊戲結果做排名，這些排名能夠在世界地圖上的「帽客酒館」內查詢。 帽客酒館 排行榜 Dungeon Explorer雖然是實驗性質的小品遊戲，但奇幻風格的遊戲背景、眾多可愛的魔物娘角色、簡單易上手的爽快戰鬥，不論是延伸開發成手機端遊或是正統RPG都相當合適。遊戲下載點此下載 Dungeon Explorer exe執行檔 點此下載 Dungeon Explorer 專案"},{"title":"","date":"2016-09-03T09:32:57.409Z","updated":"2016-09-03T09:32:57.409Z","comments":true,"path":"works/J-Deliver.html","permalink":"http://yoursite.com/works/J-Deliver.html","excerpt":"","text":"J-Deliver—連猴子都會使用的檔案傳輸程式 J-Deliver—連猴子都會使用的檔案傳輸程式J-Deliver是一款有著華麗介面又容易使用的檔案傳輸程式程式規格 開發團隊：NCU 計算機網路 小組 團隊成員：柯政佑、許昱琳 開發工具：JAVA 程式素材：已不可考！ 程式介紹介面設計富有科幻感的J-Deliver採用無視窗邊框的簡潔設計與冷色系的介面風格。在建立連線及檔案傳輸的等待時間中，還有精美的特效動畫，給予用戶意想不到的視覺體驗。功能與特色J-Deliver是以JAVA開發的Socket一對一檔案傳輸程式，不論是Server還是Client都能執行傳送檔案與接收檔案的工作。與其他檔案傳輸軟體最大的不同在於「一條龍式的連線設定」。 所謂「一條龍」類似於電玩遊戲的教學模式，即每個介面只有一項設定或操作，使用者完成後，才會進入下一個設定介面。如下列圖示： 相較於將「選擇伺服端、客戶端」、「設定IP」、「設定檔案儲存位置」等等內容全部放置在同一個介面，這樣「一條龍」的設定流程能夠減輕使用者學習操作的負擔，使程式的使用更加輕鬆便利。程式下載點此下載 J-Deliver"},{"title":"","date":"2016-09-03T09:35:27.839Z","updated":"2016-09-03T09:35:27.839Z","comments":true,"path":"works/Magic_Microphone.html","permalink":"http://yoursite.com/works/Magic_Microphone.html","excerpt":"","text":"Magic Microphone—當柯南的領結變聲器成為手機APP… Magic Microphone—當柯南的領結變聲器成為手機APP…Magic Microphone是一款可以自由調整音頻、聲速的簡易變聲APP程式規格 開發團隊：NCU 計算機實習一下 小組 團隊成員：柯政佑、許昱琳、何昱璋 適用平台：Android 程式素材：Sounds Stretch套件 程式介紹功能與特色 Magic Microphone是一款變聲APP。使用者能透過APP內建的錄音功能錄製自己的聲音，也能讀取手機內現有的音聲檔來進行變聲。 使用者可以自行設定轉換後的聲音節拍、音調、音速，也能點擊主畫面下方的按鈕，使用APP預設的特殊效果：男聲、女聲、唐老鴨聲、鼠來寶聲。 Magic Microphone也能單純作為音樂播放軟體，APP內建多種絢麗的聲波特效（圓圈、閃電、長條…）增添了聽音樂時的樂趣。 成果展示程式下載點此下載 Magic Microphone APK 點此下載 Magic Microphone 專案"},{"title":"","date":"2016-09-01T08:00:07.000Z","updated":"2016-09-01T09:25:00.559Z","comments":true,"path":"works/Soul_of_Gomoku.html","permalink":"http://yoursite.com/works/Soul_of_Gomoku.html","excerpt":"","text":"超．五子棋魂—進藤光與塔矢亮的五子棋對決！ 超．五子棋魂—進藤光與塔矢亮的五子棋對決！超．五子棋魂是一款有著絢麗畫面的五子棋遊戲。遊戲規格 開發團隊：NCU 程式語言 小組 團隊成員：柯政佑、許昱琳 開發語言：Matlab 遊戲素材：ヒカルの碁、Konami - GCヒカルの碁3 遊戲介紹 超．五子棋魂提供兩種遊戲模式，分別是挑戰電腦AI的「VS COM」模式及讓玩家在同一台電腦上對弈的「VS PLAYER」模式。每次對弈的結果則會記錄在「Rank」中，方便日後查看。 遊戲中提供四位棋靈王角色供玩家選擇，分別是進藤光、塔矢亮、藤原佐為及奈瀨明日美。角色本身不會影響對弈的過程，玩家可以根據個人喜好將中意的角色拖曳至自己的角色格內進行對弈。 超．五子棋魂 對弈畫面 超．五子棋魂 對弈畫面 對弈期間玩家若不小心下錯位置，可以隨時點擊畫面左上方的「Undo悔棋」，將棋局退回至上一步。此外，遊戲系統會記錄敵我雙方所下的每一步棋，玩家可以點擊畫面右上方的「Data資訊」查看該局棋的棋譜。 超．五子棋魂 黑子獲勝畫面 超．五子棋魂 白子獲勝畫面 任一方不論直、橫、斜連成五子，即獲得勝利。棋盤將打上勝方棋子顏色的「終局」字樣。Matlab是一種用於演算法開發、資料視覺化、資料分析以及數值計算的高階技術計算語言。雖然Matlab也能呼叫C/C++、JAVA等其他語言來編寫，但這款【超．五子棋魂】在沒有呼叫其他語言的情況下開發，以其精美的圖像界面和絢麗的下棋動畫，顛覆了Matlab只有算式、矩陣和圖表的印象。遊戲下載點此下載 超．五子棋魂"},{"title":"","date":"2016-09-04T08:26:01.391Z","updated":"2016-09-04T08:26:01.391Z","comments":true,"path":"works/index.html","permalink":"http://yoursite.com/works/index.html","excerpt":"","text":"My Works PC Game Code Quest 超·五子棋魂 Dungeon Explorer Clash of Tower PC Application Dream Camera J-Deliver Android/IOS APP Magic Microphone"}],"posts":[{"title":"賀！個人部落格開張~","slug":"hello-world","date":"2016-09-04T09:00:17.000Z","updated":"2016-09-06T04:39:14.499Z","comments":true,"path":"2016/09/04/hello-world/","link":"","permalink":"http://yoursite.com/2016/09/04/hello-world/","excerpt":"","text":"警告：這是測試用的廢文！ 以前就曾考慮過創立部落格，正好趁這個實驗室需要個人網頁的時機弄一個。平時把一些作品或經驗談放到部落格統整，以後面試做履歷應該會方便許多，想想也是挺好的。 既然是第一次…，啊不是，我是說第一篇文，當然要讓天才少女助手來開場啦！言而總之，這個部落格剛開張，未來會變怎樣我也不知道…… 另外，在這邊提醒一下，個人作品集內的程式都是「介紹文比實際內容有趣的拋棄式程式」，也就是學校Demo完就扔到一旁的玩意，現在能不能執行我都不清楚，沒事最好不要下載XD","categories":[{"name":"雜記","slug":"雜記","permalink":"http://yoursite.com/categories/雜記/"}],"tags":[{"name":"廢文","slug":"廢文","permalink":"http://yoursite.com/tags/廢文/"}],"keywords":[{"name":"雜記","slug":"雜記","permalink":"http://yoursite.com/categories/雜記/"}]}]}